[
  {
    "id": 1,
    "authors": "Olukayode O Jegede, Olugbenga J. Owojori, Jorg. Römbke",
    "year": 2017,
    "title": "Temperature influences the toxicity of deltamethrin, chlorpyrifos and dimethoate to the predatory mite Hypoaspis aculeifer (Acari) and the springtail Folsomia candida (Collembola)",
    "journal": "Ecotoxicology and Environmental Safety",
    "doi": "https://www.sciencedirect.com/science/article/pii/S0147651317301264",
    "volume": "140",
    "pages": "214–221"
  },
  {
    "id": 2,
    "authors": "Ikram Jaabiri Kamoun, Olukayode O Jegede, Olugbenga J Owojori, Jalel Bouzid, Radhia Gargouri, Jorg Römbke",
    "year": 2018,
    "title": "Effects of deltamethrin, dimethoate and chlorpyrifos on survival and reproduction of the Collembolan, Folsomia candida and the predatory mite, Hypoaspis aculeifer in two African and two European soils",
    "journal": "Integrated Environmental Assessment and Management",
    "doi": "https://setac.onlinelibrary.wiley.com/doi/full/10.1002/ieam.1966",
    "volume": "9999",
    "pages": "1–13"
  },
  {
    "id": 3,
    "authors": "Olugbenga J. Owojori, Ademosu T. Oluwadamilare, Olukayode O. Jegede, Hamzat O. Fajana, Temitope O. Kehinde, Mosadoluwa A. Badejo",
    "year": 2018,
    "title": "Tropical oribatid mites in soil toxicity testing: Optimization of test protocol and the effect of two model chemicals (Cadmium and dimethoate) on Muliercula inexpectata",
    "journal": "Chemosphere",
    "doi": "https://www.sciencedirect.com/science/article/pii/S004565351832280X",
    "volume": "218",
    "pages": "948-954"
  },
  {
    "id": 4,
    "authors": "Olukayode O. Jegede, Beverley A. Hale, Steven D. Siciliano",
    "year": 2019,
    "title": "Multigenerational exposure of populations of Oppia nitens to zinc under pulse and continuous exposure scenarios",
    "journal": "Environmental Toxicology and Chemistry",
    "doi": "https://setac.onlinelibrary.wiley.com/doi/full/10.1002/etc.4369",
    "volume": "38",
    "pages": "896–904"
  },
  {
    "id": 5,
    "authors": "Jegede Olukayode, Awuah Kobby, Fajana Hamzat, Owojori Olugbenga, Hale Beverley, Siciliano Steven",
    "year": 2019,
    "title": "The forgotten role of toxicodynamics: how habitat quality alters the mite, Oppia nitens susceptibility to zinc, independent of toxicokinetics",
    "journal": "Chemosphere",
    "doi": "https://www.sciencedirect.com/science/article/pii/S004565351930743X",
    "volume": "227",
    "pages": "444-454"
  },
  {
    "id": 6,
    "authors": "Kobby Fred Awuah, Olukayode Jegede, Mark Cousins, Mathieu Renaud, Beverley Hale and Steven D. Siciliano",
    "year": 2019,
    "title": "Toxicity assessment of metal mixtures to soil enzymes is influenced by metal dosing method",
    "journal": "Chemosphere",
    "doi": "https://www.sciencedirect.com/science/article/pii/S0045653519311348",
    "volume": "232",
    "pages": "336-376"
  },
  {
    "id": 7,
    "authors": "Hamzat O. Fajana, Amy Gainer, Olukayode O. Jegede, Kobby F. Awuah, Juliska I. Princz, Olugbenga J. Owojori, Steven D. Siciliano",
    "year": 2019,
    "title": "Oppia nitens C.L. Koch, 1836 (Acari: Oribatida): Current Status of its Bionomics and Relevance as a Model Invertebrate in Soil Ecotoxicology",
    "journal": "Environmental Toxicology and Chemistry",
    "doi": "https://setac.onlinelibrary.wiley.com/doi/abs/10.1002/etc.4574",
    "volume": null,
    "pages": null
  },
  {
    "id": 8,
    "authors": "Hamzat Fajana, Olukayode Jegede, Kyle James, Natasha Hogan, Steven Siciliano",
    "year": 2020,
    "title": "Uptake, toxicity and maternal transfer of cadmium in the oribatid mite, Oppia nitens: Implications in the risk assessment of cadmium to soil invertebrates",
    "journal": "Environmental Pollution",
    "doi": "https://doi.org/10.1016/j.envpol.2020.113912",
    "volume": null,
    "pages": "113912"
  },
  {
    "id": 9,
    "authors": "Olukayode O. Jegede, Kobby F. Awuah, Mathieu Renaud, Mark Cousins, Beverley A. Hale, Steven D. Siciliano",
    "year": 2020,
    "title": "Single metal and metal mixture toxicity of five metals to Oppia nitens in five different Canadian soils",
    "journal": "Journal of Hazardous Materials",
    "doi": "https://doi.org/10.1016/j.jhazmat.2020.122341",
    "volume": "392",
    "pages": "122341"
  },
  {
    "id": 10,
    "authors": "Mathieu Renaud, Mark Cousins, Kobby F Awuah, Olukayode Jegede, Beverley Hale, José P Sousa, Steven D Siciliano",
    "year": 2020,
    "title": "Evaluating Three Dosing Methods for Fixed-Ratio Metal Mixture Toxicity to Folsomia candida, Enchytraeus crypticus and Oppia nitens",
    "journal": "PLoS ONE",
    "doi": "https://doi.org/10.1371/journal.pone.0229794",
    "volume": "15",
    "pages": "e0229794"
  },
  {
    "id": 11,
    "authors": "Awuah Kobby F, Jegede Olukayode, Hale Beverley, Siciliano Steven",
    "year": 2020,
    "title": "Introducing the adverse ecosystem service pathway (AESP) as a tool in ecological risk assessment",
    "journal": "Environmental Science and Technology",
    "doi": "https://doi.org/10.1021/acs.est.9b06851",
    "volume": null,
    "pages": null
  },
  {
    "id": 12,
    "authors": "Mathieu Renaud, Mark Cousins, Kobby F Awuah, Olukayode Jegede, José P Sousa, Steven D Siciliano",
    "year": 2020,
    "title": "The effects of complex metal oxide mixtures on three soil invertebrates with contrasting biological traits",
    "journal": "Science of the Total Environment",
    "doi": "https://doi.org/10.1016/j.scitotenv.2020.139921",
    "volume": "738",
    "pages": "139921"
  },
  {
    "id": 13,
    "authors": "Olugbenga Owojori, Michael Awodiran, Oluwadunsin Ajana, Olukayode Jegede",
    "year": 2022,
    "title": "Toxicity and accumulation of lead and cadmium In the land snail, Archachatina papyracea in a tropical Alfisol from Southwestern Nigeria",
    "journal": "Environmental Science and Pollution Research",
    "doi": null,
    "volume": null,
    "pages": "1-11"
  },
  {
    "id": 14,
    "authors": "Awuah Kobby, Jegede Olukayode, Mathieu Renaud, Mark Cousins, Beverley A. Hale, Steven D. Siciliano",
    "year": 2022,
    "title": "Response addition (RA) is more protective of biogeochemical cycles of carbon and phosphorus compared to concentration addition (CA) in metal mixtures",
    "journal": "Environmental Pollution",
    "doi": "https://doi.org/10.1016/j.envpol.2022.119935",
    "volume": "311",
    "pages": "119935"
  },
  {
    "id": 15,
    "authors": "Hamzat O. Fajana, Tara Rozka, Olukayode Jegede, Katherine Stewart, Steven D. Siciliano",
    "year": 2022,
    "title": "More than just a substrate for mites: Moss-dominated biological soil crust protected population of the oribatid mite, Oppia nitens against cadmium toxicity in soil",
    "journal": "Science of Total Environment",
    "doi": "https://doi.org/10.1016/j.scitotenv.2022.159553",
    "volume": "857",
    "pages": "159553"
  },
  {
    "id": 16,
    "authors": "Olukayode O. Jegede, Katherine M. Standen, Steven Siciliano, Eric G. Lamb, Katherine J. Stewart",
    "year": 2023,
    "title": "Rocks, lichens, and woody litter influenced the soil invertebrate density in upland tundra heath",
    "journal": "PLoS ONE",
    "doi": "https://doi.org/10.1371/journal.pone.0282068",
    "volume": null,
    "pages": null
  },
  {
    "id": 17,
    "authors": "Olukayode Jegede, Hamzat Fajana, Keyhan Najafian, Jin Lingling, Ian Stavness, Steven Siciliano",
    "year": 2023,
    "title": "Integument colour change: Tracking delayed growth of Oppia nitens as a sub-lethal indicator of soil toxicity",
    "journal": "Environmental Pollution",
    "doi": "https://doi.org/10.1016/j.envpol.2023.122772",
    "volume": "339",
    "pages": "122772"
  },
  {
    "id": 18,
    "authors": "Paula S. Tourinho, Zuzana Bílková, Petr Kukučka, Olukayode Jegede, Jakub Hofman",
    "year": 2025,
    "title": "Effects of realistic current-use pesticide mixtures on the springtail Folsomia candida",
    "journal": "Environmental Toxicology and Chemistry",
    "doi": "https://doi.org/10.1093/etojnl/vgaf057",
    "volume": "44",
    "pages": "1347-1356"
  },
  {
    "id": 19,
    "authors": "Olukayode Jegede, Paula S. Tourinho, Violette Geissen, Jakub Hofman",
    "year": 2025,
    "title": "Prioritization of currently used pesticides in soils of main European crop scenarios for assessment of mixture toxicity and risk on terrestrial biota",
    "journal": "Journal of Hazardous Materials",
    "doi": "https://doi.org/10.1016/j.jhazmat.2025.138942",
    "volume": null,
    "pages": "138942"
  },
  {
    "id": 20,
    "authors": "Paula S. Tourinho; Zuzana Hochmanová; Petr Kukučka; Martina Hronová; Marek Šudoma; Shiva Sabzevari; Francisco Alcon; Josefina Contreras; Nelson Abrantes; Isabel Campos; Isabelle Baldi; Mathilde Bureau; Abdallah Alaoui; Florian Christ; Daniele Mandrioli; Daria Sgargi; Igor Pasković; Marija Polić Pasković; Matjaž Glavan; Paula Harkes; Esperanza Huerta Lwanga; Trine Norgaard; Vivi Schlünssen; Olukayode O. Jegede; Peter Fantke; Violette Geissen; Hans Mol; Coen J. Ritsema; Vera Silva; Paul Scheepers",
    "year": 2025,
    "title": "Occurrence of pesticide residues in harvested products of various crops from European conventional and organic farming systems",
    "journal": "Journal of Hazardous Materials",
    "doi": "https://doi.org/10.1016/j.jhazmat.2025.139113",
    "volume": "495",
    "pages": "139113"
  },
  {
    "id": 21,
    "authors": "Hamzat O. Fajana, Ademola A. Adedokun, Philip A. Abiolu, Olukayode O. Jegede, Eric G. Lamb, Steven D. Siciliano",
    "year": 2025,
    "title": "Employing the Eco-Indicator sensitivity distribution (EcoSD) to evaluate the ecological risk of chlorpyrifos on grassland soil with a history of pyric herbivory",
    "journal": "Environmental Toxicology and Chemistry",
    "doi": "https://doi.org/10.1093/etojnl/vgaf244",
    "volume": null,
    "pages": null
  }
]
